import { useEffect } from "react";
import './ui/Privacy.css';


export default function Privacy() {
    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);

    return <>
        return <>
            <h1 className="display-4"><i className="bi bi-shield-check"></i> Політика конфіденційності</h1>
            <div className="privacy-content" style={{ marginTop: '2rem' }}>
                <p>Останнє оновлення: Січень 2026</p>

                <h2>1. Вступ</h2>
                <p>Ласкаво просимо до 4epuShop. Ми поважаємо вашу конфіденційність і прагнемо захищати ваші персональні дані.</p>

                <h2>2. Дані, які ми збираємо</h2>
                <p>Ми можемо збирати персональну ідентифікаційну інформацію (Ім'я, електронна пошта, номер телефону тощо), коли ви відвідуєте наш сайт або робите покупку.</p>

                <h2>3. Як ми використовуємо ваші дані</h2>
                <p>Ми використовуємо ваші дані для обробки замовлень, керування вашим обліковим записом та надсилання спеціальних пропозицій щодо інших продуктів та послуг, які можуть вас зацікавити.</p>

                <h2>4. Зв'яжіться з нами</h2>
                <p>Якщо у вас є будь-які запитання щодо нашої політики конфіденційності, даних, які ми зберігаємо про вас, або ви хочете скористатися одним із ваших прав на захист даних, будь ласка, зв'яжіться з нами.</p>
            </div>
        </>;
    </>;
}